Revit 2026 API

# IFCExtrusionDataAddLoop Method

---

Adds a curve loop to the extrusion data.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddLoop(
	CurveLoop pLoop
)
```
```vb
Public Sub AddLoop (
	pLoop As CurveLoop
)
```
```cpp
public:
void AddLoop(
	CurveLoop^ pLoop
)
```
```fsharp
member AddLoop :
        pLoop : CurveLoop -> unit
```

#### Parameters

pLoop CurveLoop
     The curve loop.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCExtrusionData Class

Autodesk.Revit.DB.IFC Namespace